refactor: replace d2 with mermaid (#61)
